analyze -library WORK -format vhdl {/home/ms21.42/cap3/syn/constants.vhd /home/ms21.42/cap3/syn/registerfile.vhd}
elaborate REGISTER_FILE -architecture A -library WORK
analyze -library WORK -format vhdl {/home/ms21.42/cap3/syn/constants.vhd /home/ms21.42/cap3/syn/registerfile.vhd}
elaborate REGISTER_FILE -architecture A -library WORK
compile -exact_map
uplevel #0 { report_area -nosplit }
uplevel #0 { report_timing -path full -delay max -nworst 1 -max_paths 1 -significant_digits 2 -sort_by group }

#non optimized path
