gui_start
analyze -library WORK -format vhdl {/home/ms21.42/cap1/syn/constants.vhd /home/ms21.42/cap1/syn/constants.alu_type.vhd /home/ms21.42/cap1/syn/alu.vhd }
elaborate ALU -architecture BEHAVIOR1 - library WORK -parameters "N = 64"
compile -exact_map
write -hierarchy -format ddc -output /home/ms21.42/cap1/syn/ALU_conf1.dcc
write -hierarchy -format vhdl -output /home/ms21.42/cap1/syn/ALU_conf1_postsyn.vhdl
uplevel #0 { report_area -nosplit }
uplevel #0 { report_timing -path full -delay max -nworst 1 -significant_digits 2 -sort_by group }





